<?php

namespace Database\Seeders;

use App\Models\Composer;
use App\Models\Country;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Str;

class ComposersTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $names = [
            'Aaron Schroeder',
            'Akhenaton',
            'Al Khemiya',
            'B (Брайан Уэйн Трансо)',
            'BT',
            'Claude Bolling',
            'Claude Foisy',
            'Daft Punk',
            'David Grover',
            'David Hughes',
            'Dj Kore',
            'Doudou Masta',
            'Dust Brothers',
            'George S. Clinton',
            'Haim Saban',
            'Hal Foxton Beckett',
            'Hervé Lavandier',
            'Irving Szathmary',
            'John Barnes',
            'Kore & Skalp',
            'Ramon Pipin',
            'Shuki Levy',
            'Tomandandy',
            'Аарон Шрёдер',
            'Айра Ньюборн',
            'Алан Сільвестрі',
            'Алекс Вурман',
            'Алекс Геффелс',
            'Александр Деспла',
            'Альф Клаузен',
            'Антонио Санчес',
            'Аттікус Росс',
            'Бад Грін',
            'Безіл Поледуріс',
            'Бен Гомер',
            'Блейк Нілі',
            'Борис Бланк',
            'Брам Венгер',
            'Браян Тайлер',
            'Бред Вагнер',
            'Бред Фідель',
            'Гай Мун',
            'Ганс Ціммер',
            'Гарольд Фальтермаєр',
            'Гарри МакДональд',
            'Гаррі Грегсон-Вільямс',
            'Говард Шор',
            'Грем Ревелл',
            'Да Октопусс',
            'Девід Арнольд',
            'Девід Ванакор',
            'Девід Голмс',
            'Девід Кітай',
            'Девід Нессім Ловренс',
            'Девід Ньюман',
            'Девід Сарді',
            'Девід Сенборн',
            'Девід Шир',
            'Демієн Рок',
            'Денні Ельфман',
            'Денні Люкс',
            'Денніс Ч. Браун',
            'Джеймс Вінебл',
            'Джеймс Горнер',
            'Джеймс Ньютон Говард',
            'Джеррі Голдсміт',
            'Джин Мак-Даніел ',
            'Джоел Дж. Річард',
            'Джозеф ЛоДука',
            'Джон Бріон',
            'Джон Вільямс',
            'Джон Дебні',
            'Джон Дю През',
            'Джон Мерфі',
            'Джон Пітер Робінсон',
            'Джон Свайхарт',
            'Джонні Клаймек',
            'Джордж С. Клінтон',
            'Джордж Фентон',
            'Дон Девіс',
            'Дэвид Гроувер',
            'Дэн Стадни',
            'Едвард Шермур',
            'Еліот Голденталь',
            'Елмер Бернстайн',
            'Ерве Левандьє',
            'Ерік Клептон',
            'Ерік Серра',
            'Ілля Кмірал',
            'Карл Сталлинг',
            'Картер Бервелл',
            'Керол Кінг',
            'Клаус Бадельт',
            'Клінт Менселл',
            'Кліфф Мартінес',
            'Комбасчібл Едісон',
            'Кріс Бабіда',
            'Крістоф Бек',
            'Крістофер Леннерц',
            'Крістофер Тінг',
            'Крістофер Янг',
            'Куинси Джонс',
            'Лайл Воркмен',
            'Лес Браун',
            'Лі Голдрідж',
            'Ліза Джеррард',
            'Лори Стоун',
            'Людвіг Йоранссон',
            'Майк Паттон',
            'Майк Пост',
            'Майкл Абелс',
            'Майкл Брук',
            'Майкл Джаккіно',
            'Майкл Кеймен',
            'Майкл Прайс',
            'Майкл Субі',
            'Майкл Тавера',
            'Майлз Гудман',
            'Марк Айшем',
            'Марк Ішем',
            'Марк Мазесбо',
            'Марк МакГрес',
            'Марк Мансіна',
            'Марк Стрейтенфелд',
            'Марко Белтрамі',
            'Милт Франклин ',
            'Мішель Мань',
            'Найл Роджерс',
            'Олександр Азарія',
            'Патрік Дойл',
            'Пит Карпентер',
            'Питер Бернштейн',
            'Пол Гаслінгер',
            'Пол Гілріт',
            'Пол Леонард-Морґан',
            'Пол Ребджонс',
            'Пол Хаслінгер',
            'Рамін Джаваді',
            'Рассел Мэйл',
            'Ренді Едельман',
            'Ренді Ньюман',
            'Ричард Ашер',
            'Роберт Лайдекер',
            'Роберт Родрігес',
            'Роберт Фолк',
            'Роджер Беллон',
            'Рон Мэйл',
            'Руперт Грегсон-Вільямс',
            'Сільвестр Левай',
            'Стефен В. Парсонс',
            'Стівен Ендельман',
            'Стэнли Кларк',
            'Стюарт Коупленд',
            'Тайлер Бейтс',
            'Тедді Кастелуччі',
            'Теодор Шапіро',
            'Тим Уинн',
            'Томас Ньюман',
            'Тревор Рабін',
            'Уильям Лэйва',
            'Фред Стейнер',
            'Фред Фідель',
            'Фредерік Талгорн',
            'Френсіс Гайнс',
            'Фрибайрн-Смит',
            'Хуан Гарсія Есківель',
            'Чак Лоррі',
            'Ян Стівенс',
            'Невідомо',
        ];

        foreach ($names as $name) {
            Composer::create([
                'name' => $name,
            ]);
        }











        /* цей варіант вимагає вручну вказувати slug
                 $data =
                    [
                        'title' => 'Детективekkw',
                 'slug' => 'ggggggggw'

                ];

                DB::table('countries')->insert($data);*/


    }
}
